ЛИС2/src/InformationRegisters/ЛабораторноеОборудованиеВЭксплуатации/ЛабораторноеОборудованиеВЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛабораторноеОборудованиеВЭксплуатации</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаВводаВЭксплуатацию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокДопустимойЭксплуатации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.лис_Лаборатории</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.лис_ЛабораторноеОборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаводскойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаводскоеОбозначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПаспортаНаОборудование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИзготовления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЛИС2/src/InformationRegisters/ЛабораторноеОборудованиеВЭксплуатации/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура ОткрытьСведенияОбОборудовании(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	ПараметрыФормы = СформироватьСтруктуруСведений(ТекущаяСтрока);
	ОткрытьФорму("РегистрСведений.ЛабораторноеОборудованиеВЭксплуатации.Форма.СведенияОбОборудовании", ПараметрыФормы
				,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры


&НаСервере
Функция СформироватьСтруктуруСведений(ТекущаяСтрока)
	
	ПараметрыФормы = Новый Структура("Организация, Лаборатория, Оборудование, РегистрационныйНомер, ИнвентарныйНомер, ЗаводскойНомер, 
								| ЗаводскоеОбозначение, НомерПаспортаНаОборудование, ДатаИзготовления, 
								| ДатаВводаВЭксплуатацию, СрокДопустимойЭксплуатации");
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, ТекущаяСтрока);
	
	Возврат ПараметрыФормы;
	
КонецФункции
